ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
                    case '3':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 4);
                        LCD_I2C_WriteString("Ver Horarios");
                        __delay_ms(2000);
                        SubProceso_VerHorarios();
                        break;

                    case '4':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 1);
                        LCD_I2C_WriteString("Registrar Pastilla");
                        __delay_ms(2000);
                        SubProceso_RegistrarPastillas();
                        break;

                    case '*':
                        Buzzer_CorrectSound(&buzzer1);
                        return;

                    default:
                        /* Opción inválida: informar al usuario y
                           volver a mostrar el menú. */
                        Buzzer_ErrorSound(&buzzer1);
                        LCD_I2C_SetCursor(2, 2);
                        LCD_I2C_WriteString("Opcion Invalida");
                        __delay_ms(500);

                        tecla = KEYPAD_NO_KEY;
                        break;
                }
            }

            /* Retardo para evitar lecturas excesivamente rápidas */
            __delay_ms(10);
        }
    }
}
/******************************************************************************
 * Función: SubProceso_VerHorarios
 *----------------------------------------------------------------------------
 * Permite visualizar los horarios almacenados en la memoria EEPROM.
 *
 * Flujo:
 *   1. Lee la cantidad de horarios registrados.
 *   2. Verifica que los datos almacenados sean válidos.
 *   3. Prepara la información para su visualización.
 *   4. Muestra los horarios en páginas de hasta 3 registros.
 *   5. Permite navegar entre páginas mediante el teclado.
 *
 * Controles:
 *   A -> Página anterior.
 *   B -> Página siguiente.
 *   * -> Salir.
 ******************************************************************************/
void SubProceso_VerHorarios(void)
{
    /*==============================================================
     * Leer cantidad de horarios registrados
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,6);
    LCD_I2C_WriteString("Horarios");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(1);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar información almacenada
     *==============================================================*/
    if (dato_memoria == 0xFF || dato_memoria > 6)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    if (dato_memoria == 0)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_WriteString("Sin Hor. Registrados");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Preparar información para mostrarla en pantalla
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Preparando Datos");

    MostrarAnimacionCarga(4,8);
    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Variables de navegación
     *==============================================================*/
    uint8_t cant_horarios = dato_memoria;
    uint8_t pagina = 0;
    uint8_t paginas_max = (cant_horarios - 1) / 3;

    /*==============================================================
     * Navegación entre páginas
     *==============================================================*/
    while (1)
    {
        /*----------------------------------------------------------
         * Mostrar encabezado
         *----------------------------------------------------------*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1,0);
        LCD_I2C_WriteString("--- MIS HORARIOS ---");

        /*----------------------------------------------------------
         * Mostrar horarios de la página actual
         *----------------------------------------------------------*/
        uint8_t horarios_por_pagina;
        switch (pagina)
        {
            case 0:
                if(cant_horarios>3)
                {
                    horarios_por_pagina=3;
                }else
                {
                    horarios_por_pagina=cant_horarios;
                }
                
                for (uint8_t x=0;x<horarios_por_pagina;x++)
                {
                    LCD_I2C_SetCursor(x+2,0);
                    Detallar_Horarios(x+1,9+(5*x),10+(5*x),13+(5*x));
                }
                break;

            case 1:
                
                if(cant_horarios-3>3)
                {
                    horarios_por_pagina=3;
                }else
                {
                    horarios_por_pagina=cant_horarios-3;
                }
                
                for (uint8_t y=0;y<horarios_por_pagina;y++)
                {
                    LCD_I2C_SetCursor(y+2,0);
                    Detallar_Horarios(y+4,24+(5*y),25+(5*y),28+(5*y));
                }
                break;
        }

        /*----------------------------------------------------------
         * Mostrar controles de navegación
         *----------------------------------------------------------*/
        if (pagina > 0)
        {
            LCD_I2C_SetCursor(2,12);
            LCD_I2C_WriteString("[A]Subir");
        }

        if (pagina < paginas_max)
        {
            LCD_I2C_SetCursor(4,12);
            LCD_I2C_WriteString("[B]Bajar");
        }

        LCD_I2C_SetCursor(3,12);
        LCD_I2C_WriteString("[*]Salir");

        /*----------------------------------------------------------
         * Esperar una tecla del usuario
         *----------------------------------------------------------*/
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        /*----------------------------------------------------------
         * Procesar la tecla presionada
         *----------------------------------------------------------*/
        switch (tecla)
        {
            case 'A':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina > 0)
                    pagina--;

                break;

            case 'B':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina < paginas_max)
                    pagina++;

                break;

            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            default:

                /* Tecla sin función en esta pantalla */
                Buzzer_WarningSound(&buzzer1);
                break;
        }
    }
}
/*
 * ============================================================================
 * FUNCIÓN: SubProceso_ModificarHorario
 * ============================================================================
 * Permite modificar un horario de dispensación previamente registrado.
 *
 * Flujo:
 * 1. Verifica que existan horarios almacenados.
 * 2. Solicita seleccionar el horario a modificar.
 * 3. Solicita la nueva hora en formato 24 horas (HHMM).
 * 4. Solicita el nuevo número de pastillero (1-4).
 * 5. Espera confirmación final del usuario.
 * 6. Actualiza el horario en la EEPROM.
 * 7. Muestra un mensaje de confirmación.
 * ============================================================================
 */
void SubProceso_ModificarHorario(void)
{
    /*
     * Variables locales
     */
    uint8_t horario_selecionado;
    uint8_t pastillero_modificado;
    uint8_t hora_modificada[4] = {};
    
    /*----------------------------------------------------------------------
     * Verificar si existen horarios disponibles para modificar.
     *----------------------------------------------------------------------*/
    if (EEPROM_ReadByte(1) == 0)
    {
        LCD_I2C_Clear();
        LCD_I2C_SetCursor(2,3);
        LCD_I2C_WriteString("No hay Horarios");
        return;
    }
    
    /* Obtener la cantidad de horarios actualmente almacenados */
    dato_memoria = EEPROM_ReadByte(1);
        
    /*----------------------------------------------------------------------
     * Selección del horario a modificar.
     *----------------------------------------------------------------------*/

