ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    /*
        -- NUEVO HORARIO ---
        Asignar pastillero:
        Numero (1-4): [ ]
        [*] Salir
    */

    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("-- NUEVO HORARIO ---");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Asignar pastillero:");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Numero (1-4): [ ]");

    LCD_I2C_SetCursor(4,11);
    LCD_I2C_WriteString("[*] Salir");

    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /* Pastilleros válidos */
            case '1':
            case '2':
            case '3':
            case '4':

                Buzzer_ButtonClick(&buzzer1);

                pastillero_selecionado = tecla - '0';

                LCD_I2C_SetCursor(3,15);
                LCD_I2C_WriteChar(tecla);

                __delay_ms(500);
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Ingreso de la hora.
     *----------------------------------------------------------------------*/

    /*
        -- HORARIO PAST. X --
        Ingrese hora (24H):

            [ xx:xx ]

        [*] Salir
    */

    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("-- HORARIO PAST. _--");

    LCD_I2C_SetCursor(1,17);
    LCD_I2C_WriteUInt8(pastillero_selecionado,1);

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Ingrese hora (24H):");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("     [ xx:xx ]");

    LCD_I2C_SetCursor(4,11);
    LCD_I2C_WriteString("[*] Salir");

    /*
     * Solicitar los cuatro dígitos:
     * HHMM
     */
    for (uint8_t x = 0; x < 4; x++)
    {
        while (1)
        {
            tecla = KEYPAD_NO_KEY;

            while (tecla == KEYPAD_NO_KEY)
            {
                tecla = Keypad_Read(&teclado);
                __delay_ms(20);
            }

            switch (tecla)
            {
                /* Teclas no permitidas */
                case 'A':
                case 'B':
                case 'C':
                case 'D':
                case '#':

                    Buzzer_WarningSound(&buzzer1);
                    tecla = KEYPAD_NO_KEY;
                    break;

                /* Cancelar ingreso */
                case '*':

                    Buzzer_ButtonClick(&buzzer1);
                    return;

                /* Se recibió un número */
                default:

                    Buzzer_ButtonClick(&buzzer1);

                    /* Mostrar el dígito en pantalla */
                    if (x <= 1)
                        LCD_I2C_SetCursor(3, x + 7);
                    else
                        LCD_I2C_SetCursor(3, x + 8);

                    LCD_I2C_WriteChar(tecla);

                    __delay_ms(500);

                    hora[x] = tecla - '0';

                    /*
                     * Validación del formato HHMM
                     */

                    switch (x)
                    {
                        /* Primer dígito de la hora (0-2) x0:00*/
                        case 0:

                            if (hora[x] > 2)
                            {
                                Buzzer_WarningSound(&buzzer1);

                                LCD_I2C_SetCursor(3,7);
                                LCD_I2C_WriteString("x");

                                tecla = KEYPAD_NO_KEY;
                            }
                            break;

                        /* Segundo dígito de la hora (0-3) 0x:00 */
                        case 1:

                            if ((hora[0] == 2) && (hora[x] > 3))
                            {
                                Buzzer_WarningSound(&buzzer1);

                                LCD_I2C_SetCursor(3,8);
                                LCD_I2C_WriteString("x");

                                tecla = KEYPAD_NO_KEY;
                            }
                            break;

                        /* Decena de minutos (0-5)  00:x00*/
                        case 2:

                            if (hora[x] > 5)
                            {
                                Buzzer_WarningSound(&buzzer1);

                                LCD_I2C_SetCursor(3,10);
                                LCD_I2C_WriteString("x");

                                tecla = KEYPAD_NO_KEY;
                            }
                            break;
                    }

                    break;
            }

            /* Continuar con el siguiente dígito */
            if (tecla != KEYPAD_NO_KEY)
                break;
        }
    }

    /*----------------------------------------------------------------------
     * Confirmación de guardado.
     *----------------------------------------------------------------------*/

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Guardar: [*]Salir");

    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                break;

            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Guardar el nuevo horario en EEPROM.
     *----------------------------------------------------------------------*/

